app/controllers/food_item_controller.rb

SELECT  "food_items".* FROM "food_items"  WHERE "food_items"."id" = ? LIMIT 1
---
  def show
    if params[:id]
      @id_of_URL = params[:id]
      @food_id = FoodItem.find(@id_of_URL)